z88kat/T-Deck-NetHack/lilygo/sdkconfig.defaults
# tdeck-nethack default ESP-IDF config.
#
# Override with `idf.py menuconfig`; this file is the floor.

# --- Target hardware -------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# --- Flash + partition layout ---------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM (T-Deck has 8 MB OPI PSRAM) -----------------------------------
# Required for NetHack's working set + framebuffer.  T-Deck's WROVER-style
# module wires PSRAM on the OPI bus at 80 MHz.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Threshold: allocations bigger than this go to PSRAM by default; small ones
# stay in internal SRAM where access is single-cycle.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# Push NetHack's large static data (monst/objects tables, etc.) into PSRAM
# so it doesn't blow internal DRAM (320 KB total).
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# NB: CONFIG_SPIRAM_FETCH_INSTRUCTIONS and CONFIG_SPIRAM_RODATA were tried
# but caused a "Cache disabled but cached memory region accessed" panic in
# decl_globals_init's memset of g* structs.  They aren't needed -- the
# linker fragment routes our .ext_ram.bss directly to extern_ram.
# Run the PSRAM self-test at boot so bad-init shows up in the boot log
# instead of as a cryptic later crash.
CONFIG_SPIRAM_MEMTEST=y

# --- FreeRTOS -------------------------------------------------------------
# NetHack runs in its own task on core 1; bump the system tick to 1 ms so
# nethack's delay_output() granularity is reasonable.
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# --- Newlib / libc --------------------------------------------------------
# NetHack 5.0 uses %ll formats heavily; the nano-format library does not
# support them.  Use full newlib.
CONFIG_NEWLIB_NANO_FORMAT=n

# --- Logging --------------------------------------------------------------
# We want ESP_LOGI from the shim callback to surface to the console.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Compiler -------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=n

# --- Power management -----------------------------------------------------
# Dynamic frequency scaling + tickless idle let the kernel drop the CPU
# clock to 40 MHz and enter light sleep whenever every task is blocked.
# In practice the keyboard task polls every 20 ms, so the idle windows
# between polls are short -- but they add up.  With the LCD backlight off
# (90 s idle, see app_main.c) the savings are substantial.
#
# light_sleep_enable=true is passed to esp_pm_configure() at runtime in
# app_main.c; PM_ENABLE here just makes the API available.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
